{"data":{"markdownRemark":{"html":"<p>As tools and methodologies for software development have evolved, the functional programming paradigm has washed over the tools we use across the stack.  Haskell has been a <a href=\"https://github.com/BinRoot/Haskell-Data-Analysis-Cookbook\">go-to tool for developers to use for data analysis</a> for close to three decades. On the other end, languages like <a href=\"https://www.typescriptlang.org/\">TypeScript</a> and <a href=\"http://elm-lang.org/\">Elm</a> have hit the front-end landscape like a wave. Thus allowing developers to develop type-safe applications that compile to browser-readable JavaScript. You've probably heard functional programming advocates discussing all the benefits of these tools and what you can do by putting more information into a type system. And well, they're right. On the front end, if you look closely, you can see <a href=\"https://redux.js.org/introduction/prior-art#elm\">how languages like Elm influenced the architecture libraries like Redux</a>.</p>\n<p>Statically-typed programming languages give you more control over how you build software.</p>\n<p>As a note, I'm not going to spend time covering basic types and primitives here. Understanding higher kinded and dynamically kinded types requires a solid understanding of Haskell's underlying basic type system and their primitives. If you don't have that foundation, this may not be the right article for you. It may end up being more confusing than helpful.</p>\n<h3>The Higher Kinds</h3>\n<p>As a quick refresher, at its core, a type is a way of classifying <em>things</em>. We assign types to functions and use them to compare a function's declared type and the values it returns. So, how do we define types in Haskell? If you're not already aware, a <a href=\"http://learnyouahaskell.com/making-our-own-types-and-typeclasses\">value constructor accepts a value and yields a value</a>. In a similar manner, a type constructor accepts a type and yields a type.</p>\n<div class=\"gatsby-highlight\" data-language=\"haskell\"><pre class=\"language-haskell\"><code class=\"language-haskell\">data Maybe a\n  = Just a\n  | Nothing</code></pre></div>\n<p>Above, we declare a type <strong>Maybe</strong> that consists of two data constructors. <strong>Just</strong>, which accepts a value of type a, and <strong>Nothing</strong>, which does not accept any values at all. However, before we go any further, let's discuss those data constructors a bit more in depth.</p>\n<div class=\"gatsby-highlight\" data-language=\"haskell\"><pre class=\"language-haskell\"><code class=\"language-haskell\">ghci&gt; :t Just\nJust :: a -&gt; Maybe a\nghci&gt; :t Nothing\nNothing :: Maybe a</code></pre></div>\n<p><strong>Just</strong> has a function type. This means that any value we give it will become a <strong>Maybe</strong> of that type. <strong>Nothing</strong>, however, can conjure up whatever type it wants without needing a value at all. This pattern is actually pretty common, and when we declare a type <code class=\"language-text\">Nothing :: Maybe a</code>, what we're actually saying is that <strong>Nothing</strong> is. value of <strong>Maybe a</strong> for any and all types <strong>a</strong> that may be provided to it.</p>\n<p>Armed with that knowledge, you might be driven to ask: what is the type of <strong>Maybe</strong>?</p>\n<div class=\"gatsby-highlight\" data-language=\"haskell\"><pre class=\"language-haskell\"><code class=\"language-haskell\">ghci&gt; :t Maybe\n\n\\&lt;interactive\\&gt;:1:1: error:\n  • Data constructor not in scope: Maybe\n  • Perhaps you meant variable ‘maybe’ (imported from Prelude)</code></pre></div>\n<p>Hold on a second. What's going on here? Does this mean that types don't have types of their own? Well, sort of. Types have <em>kinds</em>.</p>\n<div class=\"gatsby-highlight\" data-language=\"haskell\"><pre class=\"language-haskell\"><code class=\"language-haskell\">ghci&gt; :Kind Maybe\nMaybe :: * -&gt; *</code></pre></div>\n<p>What? What is <strong>*</strong>? <strong>*</strong> is the <em>kind</em> of types which have values. At its core, what this means is that the <em>kind</em> of <strong>Maybe</strong> accepts a type that has values. This is called <a href=\"https://www.stephanboyer.com/post/115/higher-rank-and-higher-kinded-types\">higher kinded polymorphism</a>. As a generalization, higher-minded polymorphism is a method for abstracting types from values. It's analogous to how functions already abstract values from values.</p>\n<div class=\"gatsby-highlight\" data-language=\"haskell\"><pre class=\"language-haskell\"><code class=\"language-haskell\">Data HigherKinded a b\n = Bare b\n | Wrapped (a b)</code></pre></div>\n<p>Haskell's kind inference is fairly simple and straightforward. If you scroll back up to the top, you'll see the similarities between it and Haskell's type inference. This is because when we declare a type that applies a function <strong>a</strong> to a value <strong>b</strong>, Haskell knows that <strong>a</strong> must have the kind <code class=\"language-text\">* -&gt; *</code>, and a type of <em>kind</em> <strong>*</strong> that returns a type of <em>kind</em> <strong>*</strong>. In English, this means that <code class=\"language-text\">HigherKinded</code> accepts two types: the first of which is a function that does not have values itself, but when provided with a type that <em>does</em> have values, those values are then applied to the function. The second argument is simply a type that have values. Finally, it returns a type that can have ordinary values. *Think about how the <strong>Maybe</strong> type's kind would be defined in this way.*</p>\n<h3>Dynamically Kinded Programming</h3>\n<p>Moving on from higher kinded types, let's take a moment to discuss its lesser-known counterpart. The easiest way to discuss dynamically kinded types is through example.</p>\n<div class=\"gatsby-highlight\" data-language=\"haskell\"><pre class=\"language-haskell\"><code class=\"language-haskell\">ghci&gt; data Void\nghci&gt; :kind Void\nVoid :: *</code></pre></div>\n<p>When we declare a type <strong>Void</strong> and a subsequently check for that type's kind, we're greeted by <strong>*</strong>. Are you surprised? In the same way that you can productively program at the value level with dynamic types as you learn how to do when building a foundation in functional programming, you can also program at the type level with dynamic kinds.</p>\n<p><em>At its core, that's what <strong>*</strong> represents</em>.</p>\n<p>Now that you understand that, we can start encoding our first type level numbers. As an example, we can start by defining types for <a href=\"https://en.wikipedia.org/wiki/Peano_axioms\">Peano natural numbers</a>. Defining our numbers will be as easy as defining two data constructors, <strong>Zero</strong> and the <strong>Succ</strong> (Successor) of some natural number.</p>\n<div class=\"gatsby-highlight\" data-language=\"haskell\"><pre class=\"language-haskell\"><code class=\"language-haskell\">data Zero\ndata Succ a\n\ntype One = Succ Zero\ntype Two = Succ One\ntype Three = Succ Two\ntype Four = Succ (Succ (Succ (Succ Zero)))</code></pre></div>\n<p>As you can see from the example above, declaring our number types is as easy as using functional application with the two data constructors that we defined above. When defining subsequent types such as <strong>Two</strong>, or <strong>Three</strong>, you can observe that we can either reference already defined types to define the new type, or we can use functional application as in the case of the <strong>Four</strong> type. However, this method isn't without its caveats. There's nothing preventing us from declaring a type with <code class=\"language-text\">type One = Succ Bool</code>, which doesn't make any sense. In order to get around this, we'll need to introduce more kinds than the mere <strong>*</strong> kind that we've been dealing with until this point.</p>\n<h3>Data Kinds</h3>\n<p>The <code class=\"language-text\">DataKinds</code> GHC extension allows us to extend the functionality of data constructors into type constructors. As a consequence this also extends the type constructors into kind constructors. Just as with the above information, the best way to convey what this extension allows you to do is through example.</p>\n<div class=\"gatsby-highlight\" data-language=\"haskell\"><pre class=\"language-haskell\"><code class=\"language-haskell\">{-# LANGUAGE DataKinds #-}\n\ndata Nat = Zero | Succ Nat</code></pre></div>\n<p>The definition above declares a new type <strong>Nat</strong> that consists of two value constructors, <strong>Zero</strong> and <strong>Succ</strong>. The <code class=\"language-text\">DataKinds</code> extension introduced a new kind <strong>Nat</strong>, which exists in a separate namespace. In addition to this, we also get two new types, <strong>'Zero</strong>, which has the kind of <strong>Nat</strong>, and <strong>'Succ</strong>, which accepts a type of kind <strong>Nat</strong>.</p>\n<div class=\"gatsby-highlight\" data-language=\"haskell\"><pre class=\"language-haskell\"><code class=\"language-haskell\">ghci&gt; :kind &#39;Zero\n&#39;Zero :: Nat\nghci&gt; :kind &#39;Succ\n&#39;Succ :: Nat -&gt; Nat</code></pre></div>\n<p>Fairly simple, right? And as an aside, If we ever need to promote something a level up, we prefix the name with an apostrophe: <strong>'</strong>. Where it can be ambiguous, the <strong>'</strong> is used to disambiguate. Otherwise, Haskell will infer which you mean. After all, if we check the types, they should look the same!</p>\n<div class=\"gatsby-highlight\" data-language=\"haskell\"><pre class=\"language-haskell\"><code class=\"language-haskell\">ghci&gt; :type Zero\nZero :: Nat\nghci&gt; :type Succ\nSucc :: Nat -&gt; Nat</code></pre></div>\n<p>And that's all that there is to it when it comes to extending our type and kind constructors. We now have the ability to architect pretty basic types and kinds. However, in order to actually use them, though, we'll need to dive in a little deeper.</p>\n<p><em>In the next article, part two of this series on type level programming, we'll discuss how to implement these types with GADTs, Vectors, Type Families, and more.</em></p>","frontmatter":{"date":"April 10, 2018","path":"/2018/04/10/type-level-programming-part-1","title":"Type Level Programming: Part 1"}}},"pageContext":{}}